In [1]:
!pip install word2number
import pandas as pd
import numpy as np
from sklearn import linear_model
from word2number import w2n

Requirement already satisfied: word2number in /usr/local/lib/python3.6/dist-packages (1.1)

In [2]:
d=pd.read_csv("Linear_Regression_multiple_variables_exercise.csv")
d

  experience  test_sc(10)  int_sc(10)  salary($)
0        NaN          8.0           9      50000
1        NaN          8.0           6      45000
2       five          6.0           7      60000
3        two         10.0          10      65000
4      seven          9.0           6      70000
5      three          7.0          10      62000
6        ten          NaN           7      72000
7     eleven          7.0           8       8000

In [3]:
d.experience = d.experience.fillna("zero")
d

  experience  test_sc(10)  int_sc(10)  salary($)
0       zero          8.0           9      50000
1       zero          8.0           6      45000
2       five          6.0           7      60000
3        two         10.0          10      65000
4      seven          9.0           6      70000
5      three          7.0          10      62000
6        ten          NaN           7      72000
7     eleven          7.0           8       8000

In [4]:
d.experience = d.experience.apply(w2n.word_to_num)
d

   experience  test_sc(10)  int_sc(10)  salary($)
0           0          8.0           9      50000
1           0          8.0           6      45000
2           5          6.0           7      60000
3           2         10.0          10      65000
4           7          9.0           6      70000
5           3          7.0          10      62000
6          10          NaN           7      72000
7          11          7.0           8       8000

In [5]:
import math
median_test_score=math.floor(d['test_sc(10)'].mean())
median_test_score

7

In [14]:
d['test_sc(10)']=d['test_sc(10)'].fillna(median_test_score)
d

   experience  test_sc(10)  int_sc(10)  salary($)
0           0          8.0           9      50000
1           0          8.0           6      45000
2           5          6.0           7      60000
3           2         10.0          10      65000
4           7          9.0           6      70000
5           3          7.0          10      62000
6          10          7.0           7      72000
7          11          7.0           8       8000

In [15]:
reg=linear_model.LinearRegression()
reg.fit(d[['experience','test_sc(10)','int_sc(10)']],d['salary($)'])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [16]:
reg.predict([[2,9,6]])

array([63093.14419191])

In [17]:
reg.predict([[12,10,10]])

array([52072.80353276])